import openpyxl

###########################################################################################################################################################################################################################
# Инициализация словарей
bf_dict_1 = {'year':0, '1110':0 ,'1120':0, '1130':0 ,'1140':0 ,'1150':0 ,'1160':0 ,'1170':0 ,'1180':0 ,'1190':0,
                 '1210':0, '1220':0, '1230':0, '1240':0, '1250':0, '1260':0, '1310':0, '1320':0, '1330':0, '1340':0, '1350':0, '1360':0, '1370':0,
                 '1410':0, '1420':0, '1430':0, '1440':0, '1450':0, '1510':0, '1520':0, '1530':0, '1540':0, '1550':0, 
                 '1600':0, '1700':0, '2110':0, '2120':0, '2210':0, '2220':0, '2310':0, '2320':0,'2330':0,'2340':0,'2350':0,
                 '2410':0, '2411':0,'2412':0,'2460':0,'2465':0, '2510':0, '2520':0,'2530':0,'2900':0,'2910':0 }

bf_dict_2 = {'year':0, '1110':0 ,'1120':0, '1130':0 ,'1140':0 ,'1150':0 ,'1160':0 ,'1170':0 ,'1180':0 ,'1190':0,
                 '1210':0, '1220':0, '1230':0, '1240':0, '1250':0, '1260':0, '1310':0, '1320':0, '1330':0, '1340':0, '1350':0, '1360':0, '1370':0,
                 '1410':0, '1420':0, '1430':0, '1440':0, '1450':0, '1510':0, '1520':0, '1530':0, '1540':0, '1550':0, 
                 '1600':0, '1700':0, '2110':0, '2120':0, '2210':0, '2220':0, '2310':0, '2320':0,'2330':0,'2340':0,'2350':0,
                 '2410':0, '2411':0,'2412':0,'2460':0,'2465':0, '2510':0, '2520':0,'2530':0,'2900':0,'2910':0 }

bf_dict_3 = {'year':0, '1110':0 ,'1120':0, '1130':0 ,'1140':0 ,'1150':0 ,'1160':0 ,'1170':0 ,'1180':0 ,'1190':0,
                 '1210':0, '1220':0, '1230':0, '1240':0, '1250':0, '1260':0, '1310':0, '1320':0, '1330':0, '1340':0, '1350':0, '1360':0, '1370':0,
                 '1410':0, '1420':0, '1430':0, '1440':0, '1450':0, '1510':0, '1520':0, '1530':0, '1540':0, '1550':0, 
                 '1600':0, '1700':0, '2110':0, '2120':0, '2210':0, '2220':0, '2310':0, '2320':0,'2330':0,'2340':0,'2350':0,
                 '2410':0, '2411':0,'2412':0,'2460':0,'2465':0, '2510':0, '2520':0,'2530':0,'2900':0,'2910':0 }

###########################################################################################################################################################################################################################
# Метод по чтению книги XLSX
def read_workbook():

# Открытие книги
  wookbook = openpyxl.load_workbook("test.xlsx")

# Обработка бухгалтерского баланса
  worksheet = wookbook.get_sheet_by_name("Balance")   

# letters = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
  balance_let = 'HIJKLMNOPQRSTU'

  for row in range(6, worksheet.max_row):
    for col in balance_let:
      for key in bf_dict_1:
        if worksheet[col + str(row)].value == key and col == 'H':
# Заполнение словаря № 1
          if worksheet['J' + str(row)].value != '-':
            word_num = ""
            for i in worksheet['J' + str(row)].value:
              if (i != ' '):
                word_num += i                           
            bf_dict_1[key] = int(word_num)       
# Заполнение словаря № 2
          if worksheet['N' + str(row)].value != '-':
            word_num = ""      
            for i in worksheet['N' + str(row)].value:
              if (i != ' '):
                word_num += i                              
            bf_dict_2[key] = int(word_num)
# Заполнение словаря № 3
          if worksheet['R' + str(row)].value != '-':
            word_num = ""      
            for i in worksheet['R' + str(row)].value:
              if (i != ' '):
                word_num += i                              
            bf_dict_3[key] = int(word_num)

# Определяет за какой отчетный период суммы  
  word_year = worksheet['J4'].value
  year = word_year[14] + word_year[15] + word_year[16] + word_year[17]
  bf_dict_1['year'] = int(year)
  
  word_year = worksheet['M4'].value
  year = word_year[14] + word_year[15] + word_year[16] + word_year[17]
  bf_dict_2['year'] = int(year)

  word_year = worksheet['Q4'].value
  year = word_year[14] + word_year[15] + word_year[16] + word_year[17]
  bf_dict_3['year'] = int(year)

###################################################################################################
# Обработка отчета о финансовых результатах 
  worksheet = wookbook.get_sheet_by_name("Balance")

  balance_let = 'HIJKLMNOPQRST'

  for row in range(6, worksheet.max_row):
    for col in balance_let:
      for key in bf_dict_1:
        if worksheet[col + str(row)].value == key and col == 'I':
# Заполнение словаря № 1
          if worksheet['L' + str(row)].value != '-' and worksheet['L' + str(row)].value != '(-)':
            word_num = ""
            for i in worksheet['L' + str(row)].value:
              if (i != ' '):
                word_num += i                           
            bf_dict_1[key] = int(word_num)
# Заполнение словаря № 2
          if worksheet['P' + str(row)].value != '-' and worksheet['L' + str(row)].value != '(-)':
            word_num = ""
            for i in worksheet['P' + str(row)].value:
              if (i != ' '):
                word_num += i                          
            bf_dict_1[key] = int(word_num)

###########################################################################################################################################################################################################################
# Добавление дополнительных значений в словари
# Словарь 1
bf_dict_1 = {**bf_dict_1, '1100': bf_dict_1['1110'] + bf_dict_1['1120']+ bf_dict_1['1130'] + bf_dict_1['1140']+ bf_dict_1['1150']+ bf_dict_1['1160']+ bf_dict_1['1170'] + bf_dict_1['1180']+ bf_dict_1['1190']}
bf_dict_1 = {**bf_dict_1, '1200': bf_dict_1['1210'] + bf_dict_1['1220']+ bf_dict_1['1230'] + bf_dict_1['1240']+ bf_dict_1['1250']+ bf_dict_1['1260']}
bf_dict_1 = {**bf_dict_1, '1300': bf_dict_1['1310'] + bf_dict_1['1320']+ bf_dict_1['1330'] + bf_dict_1['1340']+ bf_dict_1['1350']+ bf_dict_1['1360']+ bf_dict_1['1370']}
bf_dict_1 = {**bf_dict_1, '1400': bf_dict_1['1410'] + bf_dict_1['1420']+ bf_dict_1['1430'] + bf_dict_1['1440']+ bf_dict_1['1450']}
bf_dict_1 = {**bf_dict_1, '1500': bf_dict_1['1510'] + bf_dict_1['1520']+ bf_dict_1['1530'] + bf_dict_1['1540']+ bf_dict_1['1550']}
bf_dict_1 = {**bf_dict_1, '2100': bf_dict_1['2110'] + bf_dict_1['2120']}
bf_dict_1 = {**bf_dict_1, '2200': bf_dict_1['2210'] + bf_dict_1['2220'] + bf_dict_1['2100']}
bf_dict_1 = {**bf_dict_1, '2300': bf_dict_1['2310'] + bf_dict_1['2320'] + bf_dict_1['2330'] + bf_dict_1['2340']+ bf_dict_1['2350']+ bf_dict_1['2200']}
bf_dict_1 = {**bf_dict_1, '2400': bf_dict_1['2410'] + bf_dict_1['2460'] + bf_dict_1['2465'] + bf_dict_1['2300']}
bf_dict_1 = {**bf_dict_1, '2500': bf_dict_1['2510'] + bf_dict_1['2520'] + bf_dict_1['2530'] + bf_dict_1['2400']}
bf_dict_1 = {**bf_dict_1, '2500': bf_dict_1['2510'] + bf_dict_1['2520'] + bf_dict_1['2530'] + bf_dict_1['2400']}

# Словарь 2
bf_dict_2 = {**bf_dict_2, '1100': bf_dict_2['1110'] + bf_dict_2['1120']+ bf_dict_2['1130'] + bf_dict_2['1140']+ bf_dict_2['1150']+ bf_dict_2['1160']+ bf_dict_2['1170'] + bf_dict_2['1180']+ bf_dict_2['1190']}
bf_dict_2 = {**bf_dict_2, '1200': bf_dict_2['1210'] + bf_dict_2['1220']+ bf_dict_2['1230'] + bf_dict_2['1240']+ bf_dict_2['1250']+ bf_dict_2['1260']}
bf_dict_2 = {**bf_dict_2, '1300': bf_dict_2['1310'] + bf_dict_2['1320']+ bf_dict_2['1330'] + bf_dict_2['1340']+ bf_dict_2['1350']+ bf_dict_2['1360']+ bf_dict_2['1370']}
bf_dict_2 = {**bf_dict_2, '1400': bf_dict_2['1410'] + bf_dict_2['1420']+ bf_dict_2['1430'] + bf_dict_2['1440']+ bf_dict_2['1450']}
bf_dict_2 = {**bf_dict_2, '1500': bf_dict_2['1510'] + bf_dict_2['1520']+ bf_dict_2['1530'] + bf_dict_2['1540']+ bf_dict_2['1550']}
bf_dict_2 = {**bf_dict_2, '2100': bf_dict_2['2110'] + bf_dict_2['2120']}
bf_dict_2 = {**bf_dict_2, '2200': bf_dict_2['2210'] + bf_dict_2['2220'] + bf_dict_2['2100']}
bf_dict_2 = {**bf_dict_2, '2300': bf_dict_2['2310'] + bf_dict_2['2320'] + bf_dict_2['2330'] + bf_dict_2['2340']+ bf_dict_2['2350']+ bf_dict_2['2200']}
bf_dict_2 = {**bf_dict_2, '2400': bf_dict_2['2410'] + bf_dict_2['2460'] + bf_dict_2['2465'] + bf_dict_2['2300']}
bf_dict_2 = {**bf_dict_2, '2500': bf_dict_2['2510'] + bf_dict_2['2520'] + bf_dict_2['2530'] + bf_dict_2['2400']}
bf_dict_2 = {**bf_dict_2, '2500': bf_dict_2['2510'] + bf_dict_2['2520'] + bf_dict_2['2530'] + bf_dict_2['2400']}

# Словарь 3
bf_dict_3 = {**bf_dict_3, '1100': bf_dict_3['1110'] + bf_dict_3['1120']+ bf_dict_3['1130'] + bf_dict_3['1140']+ bf_dict_3['1150']+ bf_dict_3['1160']+ bf_dict_3['1170'] + bf_dict_3['1180']+ bf_dict_3['1190']}
bf_dict_2 = {**bf_dict_3, '1200': bf_dict_3['1210'] + bf_dict_3['1220']+ bf_dict_3['1230'] + bf_dict_3['1240']+ bf_dict_3['1250']+ bf_dict_3['1260']}
bf_dict_3 = {**bf_dict_3, '1300': bf_dict_3['1310'] + bf_dict_3['1320']+ bf_dict_3['1330'] + bf_dict_3['1340']+ bf_dict_3['1350']+ bf_dict_3['1360']+ bf_dict_3['1370']}
bf_dict_3 = {**bf_dict_3, '1400': bf_dict_3['1410'] + bf_dict_3['1420']+ bf_dict_3['1430'] + bf_dict_3['1440']+ bf_dict_3['1450']}
bf_dict_3 = {**bf_dict_3, '1500': bf_dict_3['1510'] + bf_dict_3['1520']+ bf_dict_3['1530'] + bf_dict_3['1540']+ bf_dict_3['1550']}
bf_dict_3 = {**bf_dict_3, '2100': bf_dict_3['2110'] + bf_dict_3['2120']}
bf_dict_3 = {**bf_dict_3, '2200': bf_dict_3['2210'] + bf_dict_3['2220'] + bf_dict_3['2100']}
bf_dict_3 = {**bf_dict_3, '2300': bf_dict_3['2310'] + bf_dict_3['2320'] + bf_dict_3['2330'] + bf_dict_3['2340']+ bf_dict_3['2350']+ bf_dict_3['2200']}
bf_dict_3 = {**bf_dict_3, '2400': bf_dict_3['2410'] + bf_dict_3['2460'] + bf_dict_3['2465'] + bf_dict_3['2300']}
bf_dict_3 = {**bf_dict_3, '2500': bf_dict_3['2510'] + bf_dict_3['2520'] + bf_dict_3['2530'] + bf_dict_3['2400']}
bf_dict_3 = {**bf_dict_3, '2500': bf_dict_3['2510'] + bf_dict_3['2520'] + bf_dict_3['2530'] + bf_dict_3['2400']}

###########################################################################################################################################################################################################################
#def Analitica():


###########################################################################################################################################################################################################################
###########################################################################################################################################################################################################################
###########################################################################################################################################################################################################################
###########################################################################################################################################################################################################################





##**##**##**##**##**##**##**##**##**##**##
# Точка входа

read_workbook()

##**##**##**##**##**##**##**##**##**##**##
